Revit 2027 API
FaceArray.Insert Method
Insert the specified face into the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual void Insert(
	Face item,
	int index
)
Public Overridable Sub Insert (
	item As Face,
	index As Integer
)
public:
virtual void Insert(
	Face^ item,
	int index
)
abstract Insert :
        item : Face *
        index : int -> unit
override Insert :
        item : Face *
        index : int -> unit
Parameters
item Face
The face to be inserted into the array.
index Int32
The face will be inserted before this index.
Return Value
Returns whether the face was inserted into the array.
See Also
Reference
FaceArray Class
Autodesk.Revit.DB Namespace